** Test
#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  combine4
#+end_src

#+RESULTS:
: /var/folders/_3/nwly65x92d13qp765t5gqbl40000gn/T/babel-s7wOjh/org-babel-kaIwEo.rkt:4:0: combine4: unbound identifier
:   in: combine4
:   location...:
:    /var/folders/_3/nwly65x92d13qp765t5gqbl40000gn/T/babel-s7wOjh/org-babel-kaIwEo.rkt:4:0

** Exercise 2.46
#+name:vector
#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  (define (make-vect x y) (cons x y))
  (define (xcor-vect vect) (car vect))
  (define (ycor-vect vect) (cdr vect))
  (define (add-vect v1 v2)
    (make-vect 
     (+ (xcor-vect v1) (xcor-vect v2))
     (+ (ycor-vect v1) (ycor-vect v2))))
  (define (sub-vect v1 v2)
    (make-vect 
     (- (xcor-vect v1) (xcor-vect v2))
     (- (ycor-vect v1) (ycor-vect v2))))
  (define (scale-vect s v)
    (make-vect 
     (* s (xcor-vect v))
     (* s (ycor-vect v))))
#+end_src

#+RESULTS: vector
: (3 . 9)
: (0 . 0)
: (2 . 6)

** Exercise 2.47
make selectors for frame
- origin-frame
- edge1-frame
- edge2-frame

#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  (define (make-frame origin edge1 edge2)
    (list origin edge1 edge2))

  (define (origin-frame origin)
    (car origin))

  (define (edge1-frame origin)
    (cadr origin))

  (define (edge2-frame origin)
    (caddr origin))
#+end_src

#+RESULTS:

#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  (define (make-frame origin edge1 edge2)
    (cons origin (cons edge1 edge2)))

  (define (origin-frame origin)
    (car origin))

  (define (edge1-frame origin)
    (cadr origin))

  (define (edge2-frame origin)
    (cddr origin))
#+end_src

#+RESULTS:
: /var/folders/_3/nwly65x92d13qp765t5gqbl40000gn/T/babel-s7wOjh/org-babel-MgvwnJ.rkt:15:0: draw-line: unbound identifier
:   in: draw-line
:   location...:
:    /var/folders/_3/nwly65x92d13qp765t5gqbl40000gn/T/babel-s7wOjh/org-babel-MgvwnJ.rkt:15:0

